Revit 2027 API
ParameterTypeId.FabricationPartPatNo Property
 "Part Pattern Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartPatNo { get; }
Public Shared ReadOnly Property FabricationPartPatNo As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartPatNo {
	ForgeTypeId^ get ();
}
static member FabricationPartPatNo : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace